// Lab_03_2
// Гринчук Тарас
// Лабораторна робота № 3.2
// Розгалуження, задане формулою: функція з параметрами
// Варіант №4

// Ініціалізуємо змінні
let F, x, a, b, c;

// Отримуємо значення x
x = parseInt(prompt("Введіть значення x:"));
a = parseInt(prompt("Введіть значення a:"));
b = parseInt(prompt("Введіть значення b:"));
c = parseInt(prompt("Введіть значення c:"));

// Робимо перевірку на виконання умови та відповідного до неї виразу
// спосіб 1: розгалуження в скороченій формі
if (c < 0 && x !== 0) {
   F = -a * x - c;
}
if (c > 0 && x === 0) {
   F = (x - a) / -c;
}
if (!(c < 0 && x !== 0) && !(c > 0 && x === 0)) {
   F = (b * x) / (c - a);
}
// спосіб 2: розгалуження в повній формі
if (c < 0 && x !== 0) {
   F = -a * x - c;
} else if (c > 0 && x === 0) {
   F = (x - a) / -c;
} else {
   F = (b * x) / (c - a);
}

alert(`Значення функції F дорівнює ${F}`); // Виводимо значення F
